# Завдання 1 (for). Добуток непарних чисел

print("\n--- Добуток непарних чисел ---")

# 1. Введення даних
A = int(input("Введіть число A: "))
B = int(input("Введіть число B: "))

# 2. Обчислення добутку
product = 1

for i in range(A, B + 1):
    if i % 2 != 0:
        product = product * i

# 3. Виведення результату
print("\n--- Результат обчислення ---")
print(f"Добуток непарних чисел: {product}")

# Завдання 2 (while). Підрахунок парних цифр у числі

print("\n--- Підрахунок парних цифр ---")

# 1. Введення даних
N = int(input("Введіть ціле додатне число N: "))

# 2. Підрахунок парних цифр
count = 0

while N > 0:
    digit = N % 10

    if digit % 2 == 0:
        count = count + 1

    N = N // 10

# 3. Виведення результату
print("\n--- Результат обчислення ---")
print(f"Кількість парних цифр: {count}")